
### :robot: Terraform Report
---
##### Plan: `12` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "group36mngcluster"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.30"
      + location                            = "koreacentral"
      + name                                = "group36-k8s"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "group36-k8s-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "environment" = "development"
          + "owner"       = "devops-team"
          + "project"     = "platform-engineering"
        }
      + workload_identity_enabled           = false

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + auto_scaling_enabled = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 2
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "systemnodes"
          + node_count           = (known after apply)
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2s_v2"
          + vnet_subnet_id       = (known after apply)
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile {
          + dns_service_ip      = "10.0.0.10"
          + ip_versions         = (known after apply)
          + load_balancer_sku   = "standard"
          + network_data_plane  = "azure"
          + network_mode        = (known after apply)
          + network_plugin      = "azure"
          + network_plugin_mode = "overlay"
          + network_policy      = (known after apply)
          + outbound_type       = "loadBalancer"
          + pod_cidr            = "10.244.0.0/16"
          + pod_cidrs           = (known after apply)
          + service_cidr        = "10.0.0.0/16"
          + service_cidrs       = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + service_mesh_profile {
          + external_ingress_gateway_enabled = true
          + internal_ingress_gateway_enabled = true
          + mode                             = "Istio"
          + revisions                        = [
              + "asm-1-23",
            ]
        }

      + windows_profile (known after apply)
    }

  # azurerm_kubernetes_cluster_extension.flux will be created
  + resource "azurerm_kubernetes_cluster_extension" "flux" {
      + aks_assigned_identity  = (known after apply)
      + cluster_id             = (known after apply)
      + configuration_settings = {
          + "image-automation-controller.enabled" = "true"
          + "image-reflector-controller.enabled"  = "true"
          + "notification-controller.enabled"     = "true"
          + "useKubeletIdentity"                  = "true"
        }
      + current_version        = (known after apply)
      + extension_type         = "microsoft.flux"
      + id                     = (known after apply)
      + name                   = "group36-k8s-flux"
      + release_namespace      = (known after apply)
      + release_train          = (known after apply)
      + target_namespace       = (known after apply)
    }

  # azurerm_kubernetes_cluster_node_pool.app_node_pool will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "app_node_pool" {
      + auto_scaling_enabled  = true
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_count             = 4
      + max_pods              = (known after apply)
      + min_count             = 1
      + mode                  = "User"
      + name                  = "usernodes"
      + node_count            = (known after apply)
      + node_labels           = (known after apply)
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + tags                  = {
          + "environment" = "development"
          + "owner"       = "devops-team"
          + "project"     = "platform-engineering"
        }
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_B2s_v2"
      + vnet_subnet_id        = (known after apply)
    }

  # azurerm_kubernetes_flux_configuration.flux_config will be created
  + resource "azurerm_kubernetes_flux_configuration" "flux_config" {
      + cluster_id                        = (known after apply)
      + continuous_reconciliation_enabled = true
      + id                                = (known after apply)
      + name                              = "aks-flux-extension"
      + namespace                         = "flux-system"
      + scope                             = "cluster"

      + git_repository {
          + https_key_base64         = (sensitive value)
          + https_user               = "tuilakhanh"
          + reference_type           = "branch"
          + reference_value          = "master"
          + sync_interval_in_seconds = 30
          + timeout_in_seconds       = 600
          + url                      = "https://github.com/GroupThreeSix/fluxcd-manifest"
        }

      + kustomizations {
          + depends_on                 = [
              + "image-update",
            ]
          + garbage_collection_enabled = true
          + name                       = "apps-production"
          + path                       = "apps/production"
          + recreating_enabled         = false
          + retry_interval_in_seconds  = 300
          + sync_interval_in_seconds   = 30
          + timeout_in_seconds         = 600
        }
      + kustomizations {
          + depends_on                 = [
              + "image-update",
            ]
          + garbage_collection_enabled = true
          + name                       = "apps-staging"
          + path                       = "apps/staging"
          + recreating_enabled         = false
          + retry_interval_in_seconds  = 300
          + sync_interval_in_seconds   = 30
          + timeout_in_seconds         = 600
        }
      + kustomizations {
          + depends_on                 = []
          + garbage_collection_enabled = true
          + name                       = "image-update"
          + path                       = "clusters/image-update"
          + recreating_enabled         = false
          + retry_interval_in_seconds  = 300
          + sync_interval_in_seconds   = 30
          + timeout_in_seconds         = 600
        }
      + kustomizations {
          + depends_on                 = []
          + garbage_collection_enabled = true
          + name                       = "infra-controllers"
          + path                       = "infrastructure/controllers"
          + recreating_enabled         = false
          + retry_interval_in_seconds  = 300
          + sync_interval_in_seconds   = 30
          + timeout_in_seconds         = 600
        }
    }

  # azurerm_log_analytics_workspace.k8s will be created
  + resource "azurerm_log_analytics_workspace" "k8s" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "koreacentral"
      + name                            = "group36-k8s-logs"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "group36-k8s-rg"
      + retention_in_days               = (known after apply)
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # azurerm_monitor_diagnostic_setting.aks will be created
  + resource "azurerm_monitor_diagnostic_setting" "aks" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "group36-k8s-diag"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category       = "cloud-controller-manager"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "cluster-autoscaler"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "csi-azuredisk-controller"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "csi-azurefile-controller"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "csi-snapshot-controller"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "guard"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "kube-apiserver"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "kube-audit"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "kube-audit-admin"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "kube-controller-manager"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category       = "kube-scheduler"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # azurerm_network_security_group.aks_nsg will be created
  + resource "azurerm_network_security_group" "aks_nsg" {
      + id                  = (known after apply)
      + location            = "koreacentral"
      + name                = "group36-k8s-nsg"
      + resource_group_name = "group36-k8s-rg"
      + security_rule       = (known after apply)
    }

  # azurerm_resource_group.k8s will be created
  + resource "azurerm_resource_group" "k8s" {
      + id       = (known after apply)
      + location = "koreacentral"
      + name     = "group36-k8s-rg"
    }

  # azurerm_role_assignment.aks will be created
  + resource "azurerm_role_assignment" "aks" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/c4b3fd2e-e809-401f-b436-462924dadfee/resourceGroups/group36-acr/providers/Microsoft.ContainerRegistry/registries/groupthreesix"
      + skip_service_principal_aad_check = true
    }

  # azurerm_subnet.aks_subnet will be created
  + resource "azurerm_subnet" "aks_subnet" {
      + address_prefixes                              = [
          + "10.30.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "group36-k8s-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "group36-k8s-rg"
      + virtual_network_name                          = "group36-k8s-vnet"
    }

  # azurerm_subnet_network_security_group_association.aks_subnet_nsg_association will be created
  + resource "azurerm_subnet_network_security_group_association" "aks_subnet_nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.30.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "koreacentral"
      + name                = "group36-k8s-vnet"
      + resource_group_name = "group36-k8s-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "development"
          + "owner"       = "devops-team"
          + "project"     = "platform-engineering"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aks_api_server_url     = (sensitive value)

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#12386500003`](https://github.com/GroupThreeSix/infra/actions/runs/12386500003) - commit c0125a5cc6694425ddb242320e3fd0aaae612888
